## Plan Result (ptlsbox-netbox)




<pre><code>Plan: 3 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_accesskey
  * azurerm_key_vault_secret.redis_hostname
  * azurerm_key_vault_secret.redis_port
* Update
  * azurerm_key_vault.netbox_key_vault
  * azurerm_resource_group.netbox_rg
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_resource_group.rg[0]
  * module.redis.azurerm_private_endpoint.this[0]
  * module.redis.azurerm_redis_cache.redis
  * module.redis.azurerm_resource_group.cache-resourcegroup




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.netbox_key_vault will be updated in-place
  ~ resource "azurerm_key_vault" "netbox_key_vault" {
        id                              = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
        name                            = "netbox-vault-ptlsbox"
      ~ tags                            = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.redis_accesskey will be created
  + resource "azurerm_key_vault_secret" "redis_accesskey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-redis-accesskey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_hostname will be created
  + resource "azurerm_key_vault_secret" "redis_hostname" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-redis-hostname"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_port will be created
  + resource "azurerm_key_vault_secret" "redis_port" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-redis-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.netbox_rg will be updated in-place
  ~ resource "azurerm_resource_group" "netbox_rg" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg"
        name     = "netbox-ptlsbox-rg"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-v14-flexible-data-ptlsbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox"
        name                          = "netbox-v14-flexible-ptlsbox"
      ~ tags                          = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-v14-flexible-data-ptlsbox"
        name     = "netbox-v14-flexible-data-ptlsbox"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.redis.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-cache-ptlsbox/providers/Microsoft.Network/privateEndpoints/netbox-ptlsbox"
        name                     = "netbox-ptlsbox"
      ~ tags                     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-cache-ptlsbox/providers/Microsoft.Cache/redis/netbox-ptlsbox"
        name                          = "netbox-ptlsbox"
      ~ tags                          = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redis.azurerm_resource_group.cache-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-cache-ptlsbox"
        name     = "netbox-cache-ptlsbox"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/rdo-netbox"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-07-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 7 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Target":"ptlsbox-netbox","Vars":{}} -->